Mobile/DataProcessors/ЗаписьНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗаписьНаУслуги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Mobile/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Mobile/DataProcessors/ЗаписьНаУслуги/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ЗаписатьсяНаСервере(Знач Объект) Экспорт
	ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
	
	// Проверка даты
	Если Объект.ДатаЗаписи < ТекущаяДата() Тогда
		Возврат Новый Структура("Успех, Сообщение", Ложь, "Запись на прошлую дату невозможна. Пожалуйста, выберите другую дату.");
	КонецЕсли;
	
	// Заполняем данные документа
	ЗаписьКлиента.Дата = НачалоМинуты(Объект.ДатаЗаписи);
	ЗаписьКлиента.Сотрудник = Объект.Сотрудник;
	
	СтрокаУслуги = ЗаписьКлиента.Услуги.Добавить();
	СтрокаУслуги.Услуга = Объект.Услуга;
	СтрокаУслуги.Стоимость = ЭтаФорма.Стоимость;
	
	// Создаём JSON
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	СтруктураРеквизитовДокумента = Новый Структура;
	СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
	СтруктураРеквизитовДокумента.Вставить("Клиент", ТекущийПользователь.Имя);
	СтруктураРеквизитовДокумента.Вставить("Сотрудник", Строка(Объект.Сотрудник));
	
	МассивУслуг = Новый Массив;
	Услуга = Новый Структура;
	Услуга.Вставить("Услуга", Строка(Объект.Услуга));
	Услуга.Вставить("Цена", ЭтаФорма.Стоимость);
	Услуга.Вставить("Количество", 1);
	Услуга.Вставить("Сумма", ЭтаФорма.Стоимость);
	
	МассивУслуг.Добавить(Услуга);
	СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);
	
	// Преобразуем в JSON
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента);
	
	// Отправляем документ
	ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
	
	Если ДокументУспешноОтправлен Тогда
		ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение);
		Возврат Новый Структура("Успех, Сообщение", Истина, СтрШаблон("Вы записаны на услугу %1 к мастеру %2 на дату %3",
		Объект.Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'")));
	Иначе
		Возврат Новый Структура("Успех, Сообщение", Ложь, "Не удалось отправить запись!");
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура Записаться(Команда)
	
	Результат = ЗаписатьсяНаСервере(Объект);
	
	
	Если Результат.Успех Тогда
		ОткрытьФорму("Документ.ЗаписьКлиента.Форма.ФормаСписка"); 
		
		Объект.ДатаЗаписи = '00010101';
		Объект.Сотрудник = Неопределено;
		Объект.Услуга = Неопределено;
		ЭтаФорма.Стоимость = 0;
	КонецЕсли;	
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Результат.Сообщение;
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры


&НаСервере
Процедура УслугаПриИзмененииНаСервере()
	
	ЭтаФорма.Стоимость = Объект.Услуга.Стоимость;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугаПриИзменении(Элемент) 
	
	УслугаПриИзмененииНаСервере(); 
	
КонецПроцедуры
